const out = document.querySelector(".container-area__out");
const btns = document.querySelectorAll("button");
const btnsValue = [
  "Основні данні про підприємство. Доступ до установчих документів та шаблонів договорів",
  "Опис земельних ділянок. Доступ до аналізу грунтів",
  "Опис будівель та споруд",
  "Опис техніки та обладнання",
  "Карточки працівників",
  "Опис культури. Доступ до технологічної карти",
  "Опис тварин. Доступ до раціону годівлі",
  "Журнал доходів. Ціна та кількість. Залишок, прихід, реалізація",
  "Журнал витрат. Прямі, змінні, постійні",
  "Журнал обліку готової продукції",
  "Журнал обліку матеріалів. Паливо, насіння, добрива і засоби захисту.",
];
console.log(btns[7]);
console.log(btns);
for (let i = 0; i < btns.length; i++) {
  btns[i].onclick = () => {
    out.innerHTML = btnsValue[i];
  };
}
